#pragma once

/*=================常量及符合====================
* 1、使用‘\’来对ACSSII码进行转义 例如‘\101’就表示ACSSII码‘A’
*		转义时可以使用‘\ddd’是1~3位八进制数所代表的字符 ‘\xhh’1~2位十六进制数所代表的字符
=================================================*/

#include <iostream>
using namespace std;

void Changliang()
{
	printf("--------------------常量--------------------\n");
	cout << 2018 << "  整形常量" << endl;
	cout << 2.15 << "  浮点常量（实型常量）" << endl;
	cout << 'a' << "     字符常量" << endl;
	cout << "哈哈" << "  字符串常量" << endl;

	printf("-------------------转义字符------------------\n");

	cout << "A" << endl;
	cout << "\101" << endl;
	cout << "\x41" << endl;				//A的ACSSII码的值为41 a为97..详细查看ACSSII码表
	cout << "\52,\x1E" << endl;
	cout << "\a" << "响铃" << endl;

	printf("-------------------其他常量------------------\n");
	printf("Bool常量，枚举常量，宏定义常量\n");
}
